# Exercise 1 #
Use a dataset including Name, Age, City, Salary for a bunch of people
1) Load the table in a pandas DataFrame randomly generating the data inside
2) Print first and last 5 rows
3) Print the type of each column (series)
4) Show descriptive statistics (mean, std, median) for numerical variables
5) Find and eliminate duplicates
6) Replace missing values with the median inside the column
7) Create a 'Age Category' column classifying people into Young (0-18), Adult (19-65), or Senior (>65)
8) Save the dataframe into a new CSV file

In [159]:
import pandas as pd
import numpy as np

In [160]:
names = np.array(['James','Mary','Michael','Patricia','Robert','Jennifer','John','Linda','David','Elizabeth','William','Barbara','Richard','Susan','Joseph','Jessica','Thomas','Karen','Christopher','Sarah'])
ages = np.arange(1,100)
cities = np.array(['Tokyo','New York','Paris','Sydney','Rio de Janeiro','Cape Town','Moscow','Cairo','Toronto','Mumbai'])
salaries = np.arange(20000,200001,5000)

In [161]:
samples = 10000

rng_names = np.random.choice(names,samples,replace=True)
rng_ages = np.random.choice(ages,samples,replace=True)
rng_cities = np.random.choice(cities,samples,replace=True)
rng_salaries = np.random.choice(salaries,samples,replace=True)

In [162]:
df = pd.DataFrame({'name':rng_names,'age':rng_ages,'city':rng_cities,'salary':rng_salaries})

In [163]:
df.head()

       name  age     city  salary
0   Barbara   12  Toronto   40000
1    Robert   21    Paris  120000
2      John   25   Moscow   40000
3   William   89  Toronto   35000
4  Patricia   26   Sydney  135000

In [164]:
df.tail()

             name  age            city  salary
9995        Sarah   27  Rio de Janeiro   60000
9996  Christopher   72         Toronto   30000
9997        Linda   15          Mumbai   75000
9998        Linda   59          Mumbai  200000
9999        Sarah   39           Tokyo  110000

In [165]:
df.dtypes

name      object
age        int32
city      object
salary     int32
dtype: object

In [166]:
df.describe()

                age         salary
count  10000.000000   10000.000000
mean      50.662200  110002.000000
std       28.566545   52866.667045
min        1.000000   20000.000000
25%       26.000000   65000.000000
50%       51.000000  110000.000000
75%       75.000000  155000.000000
max       99.000000  200000.000000

In [167]:
df[df.duplicated()]

          name  age            city  salary
974       John   67          Mumbai  130000
1065    Joseph   14       Cape Town  170000
1151   Richard    7         Toronto   80000
1463      Mary   63  Rio de Janeiro  145000
1958  Patricia   13         Toronto   60000
...        ...  ...             ...     ...
9728    Thomas   52           Paris   55000
9796   Richard   51           Cairo  170000
9854   Michael   32          Mumbai  105000
9936     Susan   31        New York   45000
9958   Jessica   41  Rio de Janeiro  140000

[78 rows x 4 columns]

In [168]:
df_no_duplicates = df.drop_duplicates(inplace=False)

In [169]:
print(df.shape)
print(df_no_duplicates.shape)

(10000, 4)
(9922, 4)

In [170]:
print(df_no_duplicates.isna().sum())
df_no_duplicates[df_no_duplicates.isna()]

name      0
age       0
city      0
salary    0
dtype: int64

     name  age city  salary
0     NaN  NaN  NaN     NaN
1     NaN  NaN  NaN     NaN
2     NaN  NaN  NaN     NaN
3     NaN  NaN  NaN     NaN
4     NaN  NaN  NaN     NaN
...   ...  ...  ...     ...
9995  NaN  NaN  NaN     NaN
9996  NaN  NaN  NaN     NaN
9997  NaN  NaN  NaN     NaN
9998  NaN  NaN  NaN     NaN
9999  NaN  NaN  NaN     NaN

[9922 rows x 4 columns]

In [171]:
df_imputed = df_no_duplicates.copy()
df_imputed['age'].fillna(df_imputed['age'].median(), inplace=True)
df_imputed['salary'].fillna(df_imputed['salary'].median(), inplace=True)

C:\Users\Alessio\AppData\Local\Temp\ipykernel_8280\2800402317.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_imputed['age'].fillna(df_imputed['age'].median(), inplace=True)
C:\Users\Alessio\AppData\Local\Temp\ipykernel_8280\2800402317.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df_imputed['salary'].fillna(df_imputed['salary'].median(), inplace=True)

In [172]:
df_imputed['age_category'] = df_imputed['age'].apply(lambda x: 'young' if x<19 else 'adult' if x<66 else 'senior')

In [173]:
df_imputed.head()

       name  age     city  salary age_category
0   Barbara   12  Toronto   40000        young
1    Robert   21    Paris  120000        adult
2      John   25   Moscow   40000        adult
3   William   89  Toronto   35000       senior
4  Patricia   26   Sydney  135000        adult

In [174]:
df_imputed.to_csv('people_info.csv', index=False)  # if we want to keep the index for ID purposes, set index=True

# Exercise 2 #
Generate a DataFrame of sales including 'date','city','product','sales'.
Create data for a month, with sales for 3 citites and 3 different products.
1) use numpy to generate the random data
2) create a pivot table to analyze the mean sales for each product by city
3) use groupby to show total sales by product

In [175]:
import pandas as pd
import numpy as np
import datetime

In [176]:
days = 31
dates = np.array([datetime.date(2024,1,day) for day in range(1,days+1)])
cities = np.array(['Tokyo','New York','Paris'])
products = np.array(['iphone','airpods','ipad'])
sales = np.arange(1,1001)

In [177]:
rng_cities = np.random.choice(cities,days,replace=True)
rng_products = np.random.choice(products,days,replace=True)
rng_sales = np.random.choice(sales,days,replace=True)

In [178]:
df = pd.DataFrame({'date':dates,'city':rng_cities,'product':rng_products,'sales':rng_sales})

In [179]:
df.head()

         date      city  product  sales
0  2024-01-01  New York   iphone    936
1  2024-01-02     Paris   iphone    118
2  2024-01-03     Paris   iphone    499
3  2024-01-04  New York   iphone    866
4  2024-01-05     Tokyo  airpods    314

In [180]:
df.dtypes

date       object
city       object
product    object
sales       int32
dtype: object

In [181]:
avg_sales_per_product_by_city = df.pivot_table(index='product',values='sales',columns='city',aggfunc='mean')

In [182]:
avg_sales_per_product_by_city

city     New York   Paris  Tokyo
product
airpods    219.00     NaN  278.0
ipad       546.00  572.25  678.0
iphone     573.25  308.50  480.5

In [183]:
tot_sales_per_product = df.groupby('product').sum('sales')

In [184]:
tot_sales_per_product

         sales
product
airpods   1432
ipad      8127
iphone    6164